app/Controllers/AdminController.php

    public function index()
    {
        $student = new StudentsModel();
        // Get the total number of students
        $data['total_students'] = $student->countAll();
        $data['student'] = $student->orderBy('join_date', 'DESC')  // Order by created_at or 'id' DESC
            ->limit(5)                      // Limit to the latest 5 records
            ->findAll();
---
SELECT COUNT(*) AS `numrows` FROM `student`
SELECT *
FROM `student`
ORDER BY `join_date` DESC
 LIMIT 5

    public function students()
    {
        $student = new StudentsModel();
        $data['student'] = $student->findAll();
---
SELECT *
FROM `student`

    public function deleteStudent($id)
    {
        $student = new StudentsModel();
        $student->delete($id);
---
DELETE FROM `student`
WHERE `id` IN ('12')