app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `student`
WHERE `status` = 'Approved'
SELECT COUNT(*) AS `numrows`
FROM `student`
WHERE `status` = 'Approved'
AND DATE(transaction_date) = '2024-11-12'
SELECT *
FROM `student`
WHERE `status` = 'Approved'
ORDER BY `transaction_date` DESC
 LIMIT 5
---
    public function index()
    {
        // Check if user is logged in and session has user data
        $user = session()->get('user');

        // If user is not logged in or does not have a valid ID, redirect to the home page
        if (!$user || $user['id'] < 1) {
            return redirect()->to(uri: base_url('/'));
        } else

            // Create an instance of the StudentsModel
            $student = new StudentsModel();

        // Get the total number of students with a status of 'Approved'
        $data['total_students'] = $student
            ->where('status', 'Approved')
            ->countAllResults();

        // Get today's date
        $today = date('Y-m-d'); // Format: YYYY-MM-DD

        // Count the number of students who paid today
        $data['todays_payments'] = $student
            ->where('status', 'Approved')
            ->where('DATE(transaction_date)', $today) // Filter by today's date
            ->countAllResults();

        // Get the latest 5 students, ordered by join date
        $data['student'] = $student->orderBy('transaction_date', 'DESC')
            ->where('status', 'Approved') //only return the data that has a 'Approved' status value
            ->limit(5)  //limit the data to be return
            ->findAll();

SELECT *
FROM `student`
WHERE `status` = 'Approved'
---
    public function students()
    {
        $student = new StudentsModel();
        $data['student'] = $student
            ->where('status', 'Approved')
            ->findAll();

SELECT *
FROM `membership`
---
    public function addStudentView()
    {
        $membership = new MembershipModel();
        $data['memberships'] = $membership->findAll();

INSERT INTO `student` (`student_id`, `student_name`, `degree_program`, `year_level`, `section`, `semester`, `email`, `mobile_number`, `amount_paid`, `membership_paid`, `status`, `reference_id`) VALUES ('2250503', 'Jerico Ocal', 'Bachelor of Science in Information Technology', '3', 'A', '1', 'jericoocal03@gmail.com', '09652058816', '70', '43', 'Approved', 113411773520)
---
    public function addStudent()
    {
        $membershipModel = new MembershipModel();
        $studentModel = new StudentsModel();

        // Retrieve POST data
        $selectedMemberships = $this->request->getPost('membership_name') ?: [];
        $studentData = [
            'student_id' => $this->request->getPost('student_id'),
            'student_name' => $this->request->getPost('fullname'),
            'degree_program' => $this->request->getPost('course'),
            'year_level' => $this->request->getPost('year_level'),
            'section' => $this->request->getPost('section'),
            'semester' => $this->request->getPost('semester'),
            'email' => $this->request->getPost('email'),
            'mobile_number' => $this->request->getPost('mobile_number'),
            'amount_paid' => $this->request->getPost('amount_paid'),
            'membership_paid' => $selectedMemberships ? implode(',', $selectedMemberships) : null,
            'status' => 'Approved',
            'reference_id' => $this->generateReferenceId(),
        ];

        // Save the student data
        if ($studentModel->save($studentData)) {

SELECT *
FROM `membership`
WHERE `id` IN ('43')
---
";

        if ($selectedMemberships) {
            $memberships = $membershipModel->whereIn('id', $selectedMemberships)->findAll();

SELECT *
FROM `student`
WHERE `student`.`id` = '84'
---
    public function editStudentView($id)
    {
        $student = new StudentsModel();
        $data['student'] = $student->find($id);

UPDATE `student` SET `student_id` = '12333333', `student_name` = 'Rey', `degree_program` = 'Bachelor of Science in Information Technology', `year_level` = '3', `section` = 'C', `semester` = '1', `email` = 'HELLOWORLD@gmail.com', `mobile_number` = '211231231123'
WHERE `student`.`id` IN ('84')
---
    public function updateStudentData($id)
    {
        $student = new StudentsModel();
        $student->find($id);
        $data = [
            'student_id' => $this->request->getPost('student_id'),
            'student_name' => $this->request->getPost('full_name'),
            'degree_program' => $this->request->getPost('course'),
            'year_level' => $this->request->getPost('year_level'),
            'section' => $this->request->getPost('section'),
            'semester' => $this->request->getPost('semester'),
            'email' => $this->request->getPost('email'),
            'mobile_number' => $this->request->getPost('mobile_number'),
        ];
        $student->update($id, $data);