app/Controllers/AuthenticationController.php

SELECT *
FROM `admin`
WHERE `username` = 'admin123'
 LIMIT 1
---
    public function login()
    {
        $userModel = new AdminModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Find the user by username
        $user = $userModel->where('username', $username)->first(); // Use first() to get a single record