app/Controllers/FormController.php

SELECT *
FROM `membership`
---
    public function formView()
    {
        $membership = new MembershipModel();
        $data['memberships'] = $membership->findAll();

INSERT INTO `student` (`student_id`, `student_name`, `degree_program`, `year_level`, `section`, `semester`, `email`, `mobile_number`, `amount_paid`, `membership_paid`, `status`, `reference_id`) VALUES ('2250503', 'Jerico Ocal', 'Bachelor of Science in Information Technology', '3', 'A', '1', 'jericoocal03@gmail.com', '09652058816', '140.00', '43,44', 'Approved', 587928469178)
---
    public function submit()
    {
        $membershipModel = new MembershipModel();
        $studentModel = new StudentsModel();

        // Retrieve POST data
        $selectedMemberships = $this->request->getPost('membership_name') ?: [];
        $studentData = [
            'student_id' => $this->request->getPost('student_id'),
            'student_name' => $this->request->getPost('fullname'),
            'degree_program' => $this->request->getPost('course'),
            'year_level' => $this->request->getPost('year_level'),
            'section' => $this->request->getPost('section'),
            'semester' => $this->request->getPost('semester'),
            'email' => $this->request->getPost('email'),
            'mobile_number' => $this->request->getPost('mobile_number'),
            'amount_paid' => $this->request->getPost('amount_paid'),
            'membership_paid' => $selectedMemberships ? implode(',', $selectedMemberships) : null,
            'status' => 'Approved',
            'reference_id' => $this->generateReferenceId(),
        ];

        // Save the student data
        if ($studentModel->save($studentData)) {

SELECT *
FROM `membership`
WHERE `id` IN ('43','44')
---
";

        if ($selectedMemberships) {
            $memberships = $membershipModel->whereIn('id', $selectedMemberships)->findAll();