app/Models/StudentsModel.php

SELECT SUM(`amount_paid`) AS `amount_paid`
FROM `student`
WHERE YEAR(transaction_date) = '2024'
AND MONTH(transaction_date) = '11'
 LIMIT 1
---
    public function getMonthlyRevenue()
    {
        // Get the current year and month
        $currentMonth = date('m');
        $currentYear = date('Y');

        // Perform the query to sum the 'amount_paid' where the 'paid_date' is in the current month
        return $this->selectSum('amount_paid')
                    ->where('YEAR(transaction_date)', $currentYear)
                    ->where('MONTH(transaction_date)', $currentMonth)
                    ->first();  // Using first() to get a single result